jack77er/openUTRUSTA/Packages/.cache/Keil.Kinetis_KLxx_DFP.1.8.0.pdsc
        <!-- ******************************  MKL04Z16xxx4  ****************************** -->
        <device Dname="MKL04Z16xxx4">
          <compile header="Device\Include\MKL04Z4.h"  define="MKL04Z16xxx4"/>
          <debug      svd="SVD\MKL04Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFFE00"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P16_48MHZ.FLM"   start="0x00000000"  size="0x4000"  RAMstart="0x1FFFFE00"  RAMsize="0x0800"  default="1"/>
          <book name="Documents\KL04P48M48SF1RM.pdf" title="KL04 Sub-Family Reference Manual"/>
          <book name="Documents\KL04P48M48SF1.pdf"   title="KL04 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL04Z32xxx4  ****************************** -->
        <device Dname="MKL04Z32xxx4">
          <compile header="Device\Include\MKL04Z4.h"  define="MKL04Z32xxx4"/>
          <debug      svd="SVD\MKL04Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFFC00"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P32_48MHZ.FLM"   start="0x00000000"  size="0x8000"  RAMstart="0x1FFFFC00"  RAMsize="0x1000"  default="1"/>
          <book name="Documents\KL04P48M48SF1RM.pdf" title="KL04 Sub-Family Reference Manual"/>
          <book name="Documents\KL04P48M48SF1.pdf"   title="KL04 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL05Z8xxx4  ****************************** -->
        <device Dname="MKL05Z8xxx4">
          <compile header="Device\Include\MKL05Z4.h"  define="MKL05Z8xxx4"/>
          <debug      svd="SVD\MKL05Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFFF00"  size="0x0400"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P8_48MHZ.FLM"    start="0x00000000"  size="0x2000"  RAMstart="0x1FFFFF00"  RAMsize="0x0400"  default="1"/>
          <book name="Documents\KL05P48M48SF1RM.pdf" title="KL05 Sub-Family Reference Manual"/>
          <book name="Documents\KL05P48M48SF1.pdf"   title="KL05 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL05Z16xxx4  ****************************** -->
        <device Dname="MKL05Z16xxx4">
          <compile header="Device\Include\MKL05Z4.h"  define="MKL05Z16xxx4"/>
          <debug      svd="SVD\MKL05Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFFE00"  size="0x0800"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P16_48MHZ.FLM"   start="0x00000000"  size="0x4000"  RAMstart="0x1FFFFE00"  RAMsize="0x0800"  default="1"/>
          <book name="Documents\KL05P48M48SF1RM.pdf" title="KL05 Sub-Family Reference Manual"/>
          <book name="Documents\KL05P48M48SF1.pdf"   title="KL05 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL05Z32xxx4  ****************************** -->
        <device Dname="MKL05Z32xxx4">
          <compile header="Device\Include\MKL05Z4.h"  define="MKL05Z32xxx4"/>
          <debug      svd="SVD\MKL05Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFFC00"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P32_48MHZ.FLM"   start="0x00000000"  size="0x8000"  RAMstart="0x1FFFFC00"  RAMsize="0x1000"  default="1"/>
          <book name="Documents\KL05P48M48SF1RM.pdf" title="KL05 Sub-Family Reference Manual"/>
          <book name="Documents\KL05P48M48SF1.pdf"   title="KL05 Sub-Family Data Sheet"/>
        </device>
      </subFamily>

      <!-- ******************************  KL1x    ****************************** -->
      <subFamily DsubFamily="KL1x">
        <description>
The Kinetis KL1x family of ARM Cortex-M0+ MCUs combine ultra-low-power performance with a rich suite of analog,
communication, timing and control peripherals options beyond what is offered in the Kinetis KL0x MCU family.
        </description>

        <!-- ******************************  MKL13Z32xxx4  ****************************** -->
        <device Dname="MKL13Z32xxx4">
          <compile header="Device\Include\MKL13Z644.h"  define="MKL13Z32xxx4"/>
          <debug      svd="SVD\MKL13Z644.svd"/>
          <memory     id="IROM1"                          start="0x00000000"  size="0x8000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                          start="0x1FFFFC00"  size="0x1000"    init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P32_48MHZ_KL43.FLM"  start="0x00000000"  size="0x8000"  RAMstart="0x1FFFFC00"  RAMsize="0x800"  default="1"/>
          <!--book name="Documents\KL13P80M48SF3RM.pdf" title="KL13 Sub-Family Reference Manual"/-->
          <!--book name="Documents\??.pdf"              title="KL13 Sub-Family Data Sheet"/-->
        </device>

        <!-- ******************************  MKL13Z64xxx4  ****************************** -->
        <device Dname="MKL13Z64xxx4">
          <compile header="Device\Include\MKL13Z644.h"  define="MKL13Z64xxx4"/>
          <debug      svd="SVD\MKL13Z644.svd"/>
          <memory     id="IROM1"                          start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                          start="0x1FFFF800"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P64_48MHZ_KL43.FLM"  start="0x00000000"  size="0x10000"  RAMstart="0x1FFFF800"  RAMsize="0x800"  default="1"/>
          <!--book name="Documents\KL13P80M48SF3RM.pdf" title="KL13 Sub-Family Reference Manual"/-->
          <!--book name="Documents\??.pdf"              title="KL13 Sub-Family Data Sheet"/-->
        </device>

        <!-- ******************************  MKL14Z32xxx4  ****************************** -->
        <device Dname="MKL14Z32xxx4">
          <compile header="Device\Include\MKL14Z4.h"  define="MKL14Z32xxx4"/>
          <debug      svd="SVD\MKL14Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFFC00"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P32_48MHZ.FLM"   start="0x00000000"  size="0x8000"  RAMstart="0x1FFFFC00"  RAMsize="0x1000"  default="1"/>
          <book name="Documents\KL14P80M48SF0RM.pdf" title="KL14 Sub-Family Reference Manual"/>
          <book name="Documents\KL14P80M48SF0.pdf"   title="KL14 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL14Z64xxx4  ****************************** -->
        <device Dname="MKL14Z64xxx4">
          <compile header="Device\Include\MKL14Z4.h"  define="MKL14Z64xxx4"/>
          <debug      svd="SVD\MKL14Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF800"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P64_48MHZ.FLM"   start="0x00000000"  size="0x10000"  RAMstart="0x1FFFF800"  RAMsize="0x2000"  default="1"/>
          <book name="Documents\KL14P80M48SF0RM.pdf" title="KL14 Sub-Family Reference Manual"/>
          <book name="Documents\KL14P80M48SF0.pdf"   title="KL14 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL15Z32xxx4  ****************************** -->
        <device Dname="MKL15Z32xxx4">
          <compile header="Device\Include\MKL15Z4.h"  define="MKL15Z32xxx4"/>
          <debug      svd="SVD\MKL15Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFFC00"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P32_48MHZ.FLM"   start="0x00000000"  size="0x8000"  RAMstart="0x1FFFFC00"  RAMsize="0x1000"  default="1"/>
          <book name="Documents\KL15P80M48SF0RM.pdf" title="KL14 Sub-Family Reference Manual"/>
          <book name="Documents\KL15P80M48SF0.pdf"   title="KL14 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL15Z64xxx4  ****************************** -->
        <device Dname="MKL15Z64xxx4">
          <compile header="Device\Include\MKL15Z4.h"  define="MKL15Z64xxx4"/>
          <debug      svd="SVD\MKL15Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF800"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P64_48MHZ.FLM"   start="0x00000000"  size="0x10000"  RAMstart="0x1FFFF800"  RAMsize="0x2000"  default="1"/>
          <book name="Documents\KL15P80M48SF0RM.pdf" title="KL15 Sub-Family Reference Manual"/>
          <book name="Documents\KL15P80M48SF0.pdf"   title="KL15 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL15Z128xxx4  ****************************** -->
        <device Dname="MKL15Z128xxx4">
          <compile header="Device\Include\MKL15Z4.h"  define="MKL15Z128xxx4"/>
          <debug      svd="SVD\MKL15Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P128_48MHZ.FLM"  start="0x00000000"  size="0x20000"  RAMstart="0x1FFFF000"  RAMsize="0x4000"  default="1"/>
          <book name="Documents\KL15P80M48SF0RM.pdf" title="KL15 Sub-Family Reference Manual"/>
          <book name="Documents\KL15P80M48SF0.pdf"   title="KL15 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL16Z32xxx4  ****************************** -->
        <device Dname="MKL16Z32xxx4">
          <compile header="Device\Include\MKL16Z4.h"  define="MKL16Z32xxx4"/>
          <debug      svd="SVD\MKL16Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFFC00"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P32_48MHZ.FLM"   start="0x00000000"  size="0x8000"  RAMstart="0x1FFFFC00"  RAMsize="0x1000"  default="1"/>
          <book name="Documents\KL16P80M48SF4RM.pdf" title="KL16 Sub-Family Reference Manual"/>
          <book name="Documents\KL16P64M48SF5.pdf"   title="KL16 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL16Z64xxx4  ****************************** -->
        <device Dname="MKL16Z64xxx4">
          <compile header="Device\Include\MKL16Z4.h"  define="MKL16Z64xxx4"/>
          <debug      svd="SVD\MKL16Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF800"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P64_48MHZ.FLM"   start="0x00000000"  size="0x10000"  RAMstart="0x1FFFF800"  RAMsize="0x2000"  default="1"/>
          <book name="Documents\KL16P80M48SF4RM.pdf" title="KL16 Sub-Family Reference Manual"/>
          <book name="Documents\KL16P64M48SF5.pdf"   title="KL16 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL16Z128xxx4  ****************************** -->
        <device Dname="MKL16Z128xxx4">
          <compile header="Device\Include\MKL16Z4.h"  define="MKL16Z128xxx4"/>
          <debug      svd="SVD\MKL16Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P128_48MHZ.FLM"  start="0x00000000"  size="0x20000"  RAMstart="0x1FFFF000"  RAMsize="0x4000"  default="1"/>
          <book name="Documents\KL16P80M48SF4RM.pdf" title="KL16 Sub-Family Reference Manual"/>
          <book name="Documents\KL16P64M48SF5.pdf"   title="KL16 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL16Z256xxx4  ****************************** -->
        <device Dname="MKL16Z256xxx4">
          <compile header="Device\Include\MKL16Z4.h"  define="MKL16Z256xxx4"/>
          <debug      svd="SVD\MKL16Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFE000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P256_48MHZ.FLM"  start="0x00000000"  size="0x40000"  RAMstart="0x1FFFE000"  RAMsize="0x8000"  default="1"/>
          <book name="Documents\KL16P80M48SF4RM.pdf" title="KL16 Sub-Family Reference Manual"/>
          <book name="Documents\KL16P64M48SF4.pdf"   title="KL16 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL17Z32xxx4  ****************************** -->
        <device Dname="MKL17Z32xxx4">
          <compile header="Device\Include\MKL17Z644.h"  define="MKL17Z32xxx4"/>
          <debug      svd="SVD\MKL17Z644.svd"/>
          <memory     id="IROM1"                          start="0x00000000"  size="0x8000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                          start="0x1FFFF800"  size="0x2000"    init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P32_48MHZ_KL43.FLM"  start="0x00000000"  size="0x8000"  RAMstart="0x1FFFF800"  RAMsize="0x800"  default="1"/>
          <book name="Documents\KL17P64M48SF2RM.pdf" title="KL17 Sub-Family Reference Manual"/>
          <!--book name="Documents\??.pdf"   title="KL17 Sub-Family Data Sheet"/-->
        </device>

        <!-- ******************************  MKL17Z64xxx4  ****************************** -->
        <device Dname="MKL17Z64xxx4">
          <compile header="Device\Include\MKL17Z644.h"  define="MKL17Z64xxx4"/>
          <debug      svd="SVD\MKL17Z644.svd"/>
          <memory     id="IROM1"                          start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                          start="0x1FFFF000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P64_48MHZ_KL43.FLM"  start="0x00000000"  size="0x10000"  RAMstart="0x1FFFF000"  RAMsize="0x800"  default="1"/>
          <book name="Documents\KL17P64M48SF2RM.pdf" title="KL17 Sub-Family Reference Manual"/>
          <!--book name="Documents\??.pdf"   title="KL17 Sub-Family Data Sheet"/-->
        </device>

        <!-- ******************************  MKL17Z128xxx4  ****************************** -->
        <device Dname="MKL17Z128xxx4">
          <compile header="Device\Include\MKL17Z4.h"  define="MKL17Z128xxx4"/>
          <debug      svd="SVD\MKL17Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFE000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P128_48MHZ_KL43.FLM"   start="0x00000000"  size="0x20000"  RAMstart="0x1FFFF000"  RAMsize="0x800"  default="1"/>
          <book name="Documents\KL17P64M48SF6RM.pdf" title="KL17 Sub-Family Reference Manual"/>
          <book name="Documents\KL17P64M48SF6.pdf"   title="KL17 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL17Z256xxx4  ****************************** -->
        <device Dname="MKL17Z256xxx4">
          <compile header="Device\Include\MKL17Z4.h"  define="MKL17Z256xxx4"/>
          <debug      svd="SVD\MKL17Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFE000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P256_48MHZ_KL43.FLM"   start="0x00000000"  size="0x40000"  RAMstart="0x1FFFF000"  RAMsize="0x800"  default="1"/>
          <book name="Documents\KL17P64M48SF6RM.pdf" title="KL17 Sub-Family Reference Manual"/>
          <book name="Documents\KL17P64M48SF6.pdf"   title="KL17 Sub-Family Data Sheet"/>
        </device>
      </subFamily>

      <!-- ******************************  KL2x    ****************************** -->
      <subFamily DsubFamily="KL2x">
        <description>
The Kinetis KL2x family of ARM Cortex-M0+ MCUs combine ultra-low-power performance with a rich suite of analog,
communication, timing and control peripherals, including a USB 2.0 On-the-Go (OTG) controller with an integrated low-voltage regulator.
        </description>

        <!-- ******************************  MKL24Z32xxx4  ****************************** -->
        <device Dname="MKL24Z32xxx4">
          <compile header="Device\Include\MKL24Z4.h"  define="MKL24Z32xxx4"/>
          <debug      svd="SVD\MKL24Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFFC00"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P32_48MHZ.FLM"   start="0x00000000"  size="0x8000"  RAMstart="0x1FFFFC00"  RAMsize="0x1000"  default="1"/>
          <book name="Documents\KL24P80M48SF0RM.pdf" title="KL24 Sub-Family Reference Manual"/>
          <book name="Documents\KL24P80M48SF0.pdf"   title="KL24 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL24Z64xxx4  ****************************** -->
        <device Dname="MKL24Z64xxx4">
          <compile header="Device\Include\MKL24Z4.h"  define="MKL24Z64xxx4"/>
          <debug      svd="SVD\MKL24Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF800"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P64_48MHZ.FLM"   start="0x00000000"  size="0x10000"  RAMstart="0x1FFFF800"  RAMsize="0x2000"  default="1"/>
          <book name="Documents\KL24P80M48SF0RM.pdf" title="KL24 Sub-Family Reference Manual"/>
          <book name="Documents\KL24P80M48SF0.pdf"   title="KL24 Sub-Family Data Sheet"/>
        </device>

