jack77er/openUTRUSTA/Packages/.cache/Keil.Kinetis_KLxx_DFP.1.8.0.pdsc
        <!-- ******************************  MKL25Z32xxx4  ****************************** -->
        <device Dname="MKL25Z32xxx4">
          <compile header="Device\Include\MKL25Z4.h"  define="MKL25Z32xxx4"/>
          <debug      svd="SVD\MKL25Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFFC00"  size="0x1000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P32_48MHZ.FLM"   start="0x00000000"  size="0x8000"  RAMstart="0x1FFFFC00"  RAMsize="0x1000"  default="1"/>
          <book name="Documents\KL25P80M48SF0RM.pdf" title="KL25 Sub-Family Reference Manual"/>
          <book name="Documents\KL25P80M48SF0.pdf"   title="KL25 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL25Z64xxx4  ****************************** -->
        <device Dname="MKL25Z64xxx4">
          <compile header="Device\Include\MKL25Z4.h"  define="MKL25Z64xxx4"/>
          <debug      svd="SVD\MKL25Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF800"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P64_48MHZ.FLM"   start="0x00000000"  size="0x10000"  RAMstart="0x1FFFF800"  RAMsize="0x2000"  default="1"/>
          <book name="Documents\KL25P80M48SF0RM.pdf" title="KL25 Sub-Family Reference Manual"/>
          <book name="Documents\KL25P80M48SF0.pdf"   title="KL25 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL25Z128xxx4  ****************************** -->
        <device Dname="MKL25Z128xxx4">
          <compile header="Device\Include\MKL25Z4.h"  define="MKL25Z128xxx4"/>
          <debug      svd="SVD\MKL25Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P128_48MHZ.FLM"  start="0x00000000"  size="0x20000"  RAMstart="0x1FFFF000"  RAMsize="0x4000"  default="1"/>
          <book name="Documents\KL25P80M48SF0RM.pdf" title="KL25 Sub-Family Reference Manual"/>
          <book name="Documents\KL25P80M48SF0.pdf"   title="KL25 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL26Z32xxx4  ****************************** -->
        <device Dname="MKL26Z32xxx4">
          <compile header="Device\Include\MKL26Z4.h"  define="MKL26Z32xxx4"/>
          <debug      svd="SVD\MKL26Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x08000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFFC00"  size="0x01000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P32_48MHZ.FLM"   start="0x00000000"  size="0x08000"  RAMstart="0x1FFFFC00"  RAMsize="0x1000"  default="1"/>
          <book name="Documents\KL26P121M48SF4RM.pdf" title="KL26 Sub-Family Reference Manual"/>
          <book name="Documents\KL26P121M48SF4.pdf"   title="KL26 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL26Z64xxx4  ****************************** -->
        <device Dname="MKL26Z64xxx4">
          <compile header="Device\Include\MKL26Z4.h"  define="MKL26Z64xxx4"/>
          <debug      svd="SVD\MKL26Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF800"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P64_48MHZ.FLM"   start="0x00000000"  size="0x10000"  RAMstart="0x1FFFF800"  RAMsize="0x2000"  default="1"/>
          <book name="Documents\KL26P121M48SF4RM.pdf" title="KL26 Sub-Family Reference Manual"/>
          <book name="Documents\KL26P121M48SF4.pdf"   title="KL26 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL26Z128xxx4  ****************************** -->
        <device Dname="MKL26Z128xxx4">
          <compile header="Device\Include\MKL26Z4.h"  define="MKL26Z128xxx4"/>
          <debug      svd="SVD\MKL26Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P128_48MHZ.FLM"  start="0x00000000"  size="0x20000"  RAMstart="0x1FFFF000"  RAMsize="0x4000"  default="1"/>
          <book name="Documents\KL26P121M48SF4RM.pdf" title="KL26 Sub-Family Reference Manual"/>
          <book name="Documents\KL26P121M48SF4.pdf"   title="KL26 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL26Z256xxx4  ****************************** -->
        <device Dname="MKL26Z256xxx4">
          <compile header="Device\Include\MKL26Z4.h"  define="MKL26Z256xxx4"/>
          <debug      svd="SVD\MKL26Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFE000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P256_48MHZ.FLM"  start="0x00000000"  size="0x40000"  RAMstart="0x1FFFE000"  RAMsize="0x8000"  default="1"/>
          <book name="Documents\KL26P121M48SF4RM.pdf" title="KL26 Sub-Family Reference Manual"/>
          <book name="Documents\KL26P121M48SF4.pdf"   title="KL26 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL27Z32xxx4  ****************************** -->
        <device Dname="MKL27Z32xxx4">
          <compile header="Device\Include\MKL27Z644.h"  define="MKL27Z32xxx4"/>
          <debug      svd="SVD\MKL27Z644.svd"/>
          <memory     id="IROM1"                          start="0x00000000"  size="0x8000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                          start="0x1FFFF800"  size="0x2000"    init   ="0"   default="1"/>
          <algorithm  name="Flash\MK_P32_48MHZ_KL43.FLM"  start="0x00000000"  size="0x8000"  RAMstart="0x1FFFF800"  RAMsize="0x800"  default="1"/>
          <book name="Documents\KL27P64M48SF2RM.pdf" title="KL27 Sub-Family Reference Manual"/>
          <book name="Documents\KL27P64M48SF2.pdf"   title="KL27 Sub-Family Data Sheet"/>
        </device>

