jack77er/openUTRUSTA/Packages/.cache/Keil.Kinetis_KLxx_DFP.1.8.0.pdsc
  </conditions>

  <components>
    <!-- ******************************  KL0x    ****************************** -->
    <!-- Startup MKL02Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL02Z4 CMSIS">
      <description>System Startup for Freescale MKL02Z4 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\Include\"/>
        <!-- startup / system file -->
        <file category="source"  name="Device\Source\ARM\startup_MKL02Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MKL02Z4.c"        attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MKL03Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL03Z4 CMSIS">
      <description>System Startup for Freescale MKL03Z4 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\Include\"/>
        <!-- startup / system file -->
        <file category="source"  name="Device\Source\ARM\startup_MKL03Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MKL03Z4.c"        attr="config" version="1.0.0"/>
        <!-- system header file (configurable) -->
        <file category="header"  name="Device\Source\system_MKL03Z4.h"        attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MKL04Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL04Z4 CMSIS">
      <description>System Startup for Freescale MKL04Z4 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\Include\"/>
        <!-- startup / system file -->
        <file category="source"  name="Device\Source\ARM\startup_MKL04Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MKL04Z4.c"        attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MKL05Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL05Z4 CMSIS">
      <description>System Startup for Freescale MKL05Z4 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\Include\"/>
        <!-- startup / system file -->
        <file category="source"  name="Device\Source\ARM\startup_MKL05Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MKL05Z4.c"        attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- ******************************  KL1x    ****************************** -->
    <!-- Startup MKL13Z644 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL13Z644 CMSIS">
      <description>System Startup for Freescale MKL13Z644 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\Include\"/>
        <!-- startup / system file -->
        <file category="source"  name="Device\Source\ARM\startup_MKL13Z644.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MKL13Z644.c"      attr="config" version="1.0.0"/>
        <!-- system header file (configurable) -->
        <file category="header"  name="Device\Source\system_MKL13Z644.h"      attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MKL14Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL14Z4 CMSIS">
      <description>System Startup for Freescale MKL14Z4 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\Include\"/>
        <!-- startup / system file -->
        <file category="source"  name="Device\Source\ARM\startup_MKL14Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MKL14Z4.c"        attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MKL15Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL15Z4 CMSIS">
      <description>System Startup for Freescale MKL15Z4 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\Include\"/>
        <!-- startup / system file -->
        <file category="source"  name="Device\Source\ARM\startup_MKL15Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MKL15Z4.c"        attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MKL16Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL16Z4 CMSIS">
      <description>System Startup for Freescale MKL16Z4 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\Include\"/>
        <!-- startup / system file -->
        <file category="source"  name="Device\Source\ARM\startup_MKL16Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MKL16Z4.c"        attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MKL17Z644 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL17Z644 CMSIS">
      <description>System Startup for Freescale MKL17Z644 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\Include\"/>
        <!-- startup / system file -->
        <file category="source"  name="Device\Source\ARM\startup_MKL17Z644.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MKL17Z644.c"      attr="config" version="1.0.0"/>
        <!-- system header file (configurable) -->
        <file category="header"  name="Device\Source\system_MKL17Z644.h"      attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MKL17Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL17Z4 CMSIS">
      <description>System Startup for Freescale MKL17Z4 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\Include\"/>
        <!-- startup / system file -->
        <file category="source"  name="Device\Source\ARM\startup_MKL17Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MKL17Z4.c"        attr="config" version="1.0.0"/>
        <!-- system header file (configurable) -->
        <file category="header"  name="Device\Source\system_MKL17Z4.h"        attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- ******************************  KL2x    ****************************** -->
    <!-- Startup MKL24Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL24Z4 CMSIS">
      <description>System Startup for Freescale MKL24Z4 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\Include\"/>
        <!-- startup / system file -->
        <file category="source"  name="Device\Source\ARM\startup_MKL24Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MKL24Z4.c"        attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MKL25Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL25Z4 CMSIS">
      <description>System Startup for Freescale MKL25Z4 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\Include\"/>
        <!-- startup / system file -->
        <file category="source"  name="Device\Source\ARM\startup_MKL25Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MKL25Z4.c"        attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MKL26Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL26Z4 CMSIS">
      <description>System Startup for Freescale MKL26Z4 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\Include\"/>
        <!-- startup / system file -->
        <file category="source"  name="Device\Source\ARM\startup_MKL26Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MKL26Z4.c"        attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MKL27Z644 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL27Z644 CMSIS">
      <description>System Startup for Freescale MKL27Z644 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\Include\"/>
        <!-- startup / system file -->
        <file category="source"  name="Device\Source\ARM\startup_MKL27Z644.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MKL27Z644.c"      attr="config" version="1.0.0"/>
        <!-- system header file (configurable) -->
        <file category="header"  name="Device\Source\system_MKL27Z644.h"      attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MKL27Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL27Z4 CMSIS">
      <description>System Startup for Freescale MKL27Z4 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\Include\"/>
        <!-- startup / system file -->
        <file category="source"  name="Device\Source\ARM\startup_MKL27Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MKL27Z4.c"        attr="config" version="1.0.0"/>
        <!-- system header file (configurable) -->
        <file category="header"  name="Device\Source\system_MKL27Z4.h"        attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MKL28Z7 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL28Z7 CMSIS">
      <description>System Startup for Freescale MKL28Z7 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\Include\"/>
        <!-- startup / system file -->
        <file category="source"  name="Device\Source\ARM\startup_MKL28Z7.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MKL28Z7.c"        attr="config" version="1.0.0"/>
        <!-- system header file (configurable) -->
        <file category="header"  name="Device\Source\system_MKL28Z7.h"        attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- ******************************  KL3x    ****************************** -->
    <!-- Startup MKL33Z644 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL33Z644 CMSIS">
      <description>System Startup for Freescale MKL33Z644 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\Include\"/>
        <!-- startup / system file -->
        <file category="source"  name="Device\Source\ARM\startup_MKL33Z644.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MKL33Z644.c"      attr="config" version="1.0.0"/>
        <!-- system header file (configurable) -->
        <file category="header"  name="Device\Source\system_MKL33Z644.h"      attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MKL33Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL33Z4 CMSIS">
      <description>System Startup for Freescale MKL33Z4 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\Include\"/>
        <!-- startup / system file -->
        <file category="source"  name="Device\Source\ARM\startup_MKL33Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MKL33Z4.c"        attr="config" version="1.0.0"/>
        <!-- system header file (configurable) -->
        <file category="header"  name="Device\Source\system_MKL33Z4.h"        attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MKL34Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL34Z4 CMSIS">
      <description>System Startup for Freescale MKL34Z4 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\Include\"/>
        <!-- startup / system file -->
        <file category="source"  name="Device\Source\ARM\startup_MKL34Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device\Source\system_MKL34Z4.c"        attr="config" version="1.0.0"/>
      </files>
    </component>
