jack77er/openUTRUSTA/Packages/.cache/Keil.Kinetis_KLxx_DFP.1.8.0.pdsc
  <boards>
    <board name="FRDM-KL02Z" vendor="Freescale" revision="Rev. B" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The FRDM-KL02Z is a development tool for the 48 MHz KL02 sub-familiy of Kinetis microcontrollers.</description>
      <mountedDevice    deviceIndex="0" Dvendor="Freescale:78" Dname="MKL02Z32xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KLxx Series" DsubFamily="KL0x"/>
      <feature type="ODbg"      n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Button"    n="3"/>
      <feature type="LED"       n="1"              name="RGB LED"/>
    </board>

    <board name="FRDM-KL03Z" vendor="Freescale" revision="Rev. B" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The FRDM-KL03Z is a development tool for the 48 MHz KL03 sub-familiy of Kinetis microcontrollers.</description>
      <mountedDevice    deviceIndex="0" Dvendor="Freescale:78" Dname="MKL03Z32xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KLxx Series" DsubFamily="KL0x"/>
      <feature type="ODbg"      n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Button"    n="3"/>
      <feature type="LED"       n="1"              name="RGB LED"/>
    </board>

    <board name="FRDM-KL25Z" vendor="Freescale" revision="Rev. B" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The FRDM-KL25Z is a development tool for the 48 MHz KL25 sub-familiy of Kinetis microcontrollers.</description>
      <mountedDevice    deviceIndex="0" Dvendor="Freescale:78" Dname="MKL25Z128xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KLxx Series" DsubFamily="KL0x"/>
      <feature type="ODbg"      n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Button"    n="3"/>
      <feature type="LED"       n="1"              name="RGB LED"/>
    </board>

    <board name="FRDM-KL43Z" vendor="Freescale" revision="Rev. B" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The FRDM-KL43Z is a development tool for the 48 MHz KL43 sub-familiy of Kinetis microcontrollers.</description>
      <image small="Boards\Freescale\FRDM-KL43Z\Documents\FRDM-KL43Z_small.jpg"/>
      <book category="manual"    name="Boards\Freescale\FRDM-KL43Z\Documents\FRDMKL43ZUG.pdf"    title="User Manual"/>
      <book category="schematic" name="Boards\Freescale\FRDM-KL43Z\Documents\FRDM-KL43Z_SCH.pdf" title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="Freescale:78" Dname="MKL43Z256xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KLxx Series" DsubFamily="KL4x"/>
      <feature type="Button"     n="3"             name="Push-buttons: Reset, 2x User"/>
      <feature type="LED"        n="3"             name="LEDs: SDA, 2x User"/>
      <feature type="CustomFF"   n="9"  m="8"      name="Individual Port Access"/>
      <feature type="ArduinoFF"  n="1"             name ="Form factor compatible with Arduino"/>
      <feature type="Touch"      n="1"             name="Capacitive touch slider"/>
      <feature type="LCD"        n="1" m="4.7"     name="Segment LCD"/>
      <feature type="PWR"        n="5"             name="USB Powered"/>
      <feature type="ODbg"       n="1"             name="Onboard OpenSDA via USB"/>
    </board>

    <board name="TWR-KL28Z72M" vendor="Freescale" revision="Rev. A" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The TWR-KL28Z72M is a development board for the 72 MHz KL28 sub-familiy of Kinetis microcontrollers.</description>
      <!--image small="Boards\Freescale\TWR-KL28Z72M\Documents\TWR-KL28Z72M_small.png"
             large="Boards\Freescale\TWR-KL28Z72M\Documents\TWR-KL28Z72M_large.png"/-->
      <!--book category="overview"  name="http://www.freescale.com/webapp/sps/site/prod_summary.jsp?code=TWR-KL28Z72M" title="TWR-KL28Z72M Web Page"/-->
      <!--book category="manual"    name="Boards\Freescale\TWR-KL28Z72M\Documents\TWR-KL28Z72MUG.pdf"   title="User Manual"/-->
      <!--book category="schematic" name="Boards\Freescale\TWR-KL28Z72M\Documents\TWR-KL28Z72M_SCH.pdf" title="Schematics"/-->
      <mountedDevice deviceIndex="0" Dvendor="Freescale:78" Dname="MKL28Z512xxx7"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KLxx Series" DsubFamily="KL2x"/>
      <feature type="ODbg"            n="1"        name="Onboard open-standard serial and debug adaptor (OpenSDA)"/>
      <feature type="PWR"             n="5"        name="USB Powered"/>
      <feature type="USB"             n="1"        name="Dual-role USB interface with Micro-AB USB connector"/>
      <feature type="ConnOther"       n="1"        name="General purpose Tower Plug-in (TWRPI) socket"/>
      <feature type="ConnOther"       n="2"        name="Tower connectivity for access to USB, Ethernet, RS232/RS485, CAN, SPI, I²C, Flexbus, etc."/>
      <feature type="Poti"            n="1"/>      
      <feature type="Button"          n="3"/>      
      <feature type="Touch"           n="2"/>      
      <feature type="Accelerometer"   n="1"        name="Three axis accelerometer (MMA78451Q)"/>
      <feature type="LED"             n="4"        name="Four user-controlled status LEDs"/>
      <feature type="TowerFF"         n="1"/>
    </board>

    <board name="TWR-KL82Z72M" vendor="Freescale" revision="Rev. A" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The TWR-KL82Z72M is a development board for the 72 MHz KL82 sub-familiy of Kinetis microcontrollers.</description>
      <!--image small="Boards\Freescale\TWR-KL82Z72M\Documents\TWR-KL82Z72M_small.png"
             large="Boards\Freescale\TWR-KL82Z72M\Documents\TWR-KL82Z72M_large.png"/-->
      <!--book category="overview"  name="http://www.freescale.com/webapp/sps/site/prod_summary.jsp?code=TWR-KL28Z72M" title="TWR-KL82Z72M Web Page"/-->
      <!--book category="manual"    name="Boards\Freescale\TWR-KL82Z72M\Documents\TWR-KL82Z72MUG.pdf"   title="User Manual"/-->
      <!--book category="schematic" name="Boards\Freescale\TWR-KL82Z72M\Documents\TWR-KL82Z72M_SCH.pdf" title="Schematics"/-->
      <mountedDevice deviceIndex="0" Dvendor="Freescale:78" Dname="MKL82Z128xxx7"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KLxx Series" DsubFamily="KL8x"/>
<!--
      <feature type="ODbg"            n="1"        name="Onboard open-standard serial and debug adaptor (OpenSDA)"/>
      <feature type="PWR"             n="5"        name="USB Powered"/>
      <feature type="USB"             n="1"        name="Dual-role USB interface with Micro-AB USB connector"/>
      <feature type="ConnOther"       n="1"        name="General purpose Tower Plug-in (TWRPI) socket"/>
      <feature type="ConnOther"       n="2"        name="Tower connectivity for access to USB, Ethernet, RS232/RS485, CAN, SPI, I²C, Flexbus, etc."/>
      <feature type="Poti"            n="1"/>      
      <feature type="Button"          n="3"/>      
      <feature type="Touch"           n="2"/>      
      <feature type="Accelerometer"   n="1"        name="Three axis accelerometer (MMA78451Q)"/>
      <feature type="LED"             n="4"        name="Four user-controlled status LEDs"/>
      <feature type="TowerFF"         n="1"/>
-->
      </board>

