jack77er/openUTRUSTA/Packages/.cache/Keil.Kinetis_KLxx_DFP.1.8.0.pdsc
    <board name="FRDM-KL82Z" vendor="Freescale" revision="Rev. A" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The FRDM-KL82Z is a development tool for the 72 MHz KL82 sub-familiy of Kinetis microcontrollers.</description>
<!--
      <image small="Boards\Freescale\FRDM-KL43Z\Documents\FRDM-KL43Z_small.jpg"/>
      <book category="manual"    name="Boards\Freescale\FRDM-KL43Z\Documents\FRDMKL43ZUG.pdf"    title="User Manual"/>
      <book category="schematic" name="Boards\Freescale\FRDM-KL43Z\Documents\FRDM-KL43Z_SCH.pdf" title="Schematics"/>
-->
      <mountedDevice deviceIndex="0" Dvendor="Freescale:78" Dname="MKL81Z128xxx7"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KLxx Series" DsubFamily="KL8x"/>
<!--
      <feature type="Button"     n="3"             name="Push-buttons: Reset, 2x User"/>
      <feature type="LED"        n="3"             name="LEDs: SDA, 2x User"/>
      <feature type="CustomFF"   n="9"  m="8"      name="Individual Port Access"/>
      <feature type="ArduinoFF"  n="1"             name ="Form factor compatible with Arduino"/>
      <feature type="Touch"      n="1"             name="Capacitive touch slider"/>
      <feature type="LCD"        n="1" m="4.7"     name="Segment LCD"/>
      <feature type="PWR"        n="5"             name="USB Powered"/>
      <feature type="ODbg"       n="1"             name="Onboard OpenSDA via USB"/>
-->
    </board>

    </boards>

  <examples>
    <!-- FRDM-KL02Z Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Freescale\FRDM-KL02Z\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="FRDM-KL02Z" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- FRDM-KL25Z Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Freescale\FRDM-KL25Z\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="FRDM-KL25Z" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- FRDM-KL03Z Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards\Freescale\FRDM-KL03Z\Blinky">
      <description>Blinky example</description>
      <board name="FRDM-KL03Z" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <!-- FRDM-KL43Z Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Freescale\FRDM-KL43Z\Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="FRDM-KL43Z" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- TWR-KL28Z72M Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Freescale\TWR-KL28Z72M\Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-KL28Z72M" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- TWR-KL82Z72M Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Freescale\TWR-KL82Z72M\Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-KL82Z72M" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- FRDM-KL82Z Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Freescale\FRDM-KL82Z\Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="FRDM-KL82Z" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
